Infineon/mtb-example-psoc6-ble-capsense-tuner-server/tuner_ble_server.c
/*******************************************************************************
* File Name: tuner_ble_server.c
*
* Description: This file contains BLE related functions.
*
* Related Document: README.md
*
********************************************************************************
* Copyright (2020), Cypress Semiconductor Corporation. All rights reserved.
********************************************************************************
* This software, including source code, documentation and related materials
* ("Software"), is owned by Cypress Semiconductor Corporation or one of its
* subsidiaries ("Cypress") and is protected by and subject to worldwide patent
* protection (United States and foreign), United States copyright laws and
* international treaty provisions. Therefore, you may use this Software only
* as provided in the license agreement accompanying the software package from
* which you obtained this Software ("EULA").
*
* If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
* non-transferable license to copy, modify, and compile the Software source
* code solely for use in connection with Cypress's integrated circuit products.
* Any reproduction, modification, translation, compilation, or representation
* of this Software except as specified above is prohibited without the express
* written permission of Cypress.
*
* Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
* EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
* reserves the right to make changes to the Software without notice. Cypress
* does not assume any liability arising out of the application or use of the
* Software or any product or circuit described in the Software. Cypress does
* not authorize its products for use in any products where a malfunction or
* failure of the Cypress product may reasonably be expected to result in
* significant property damage, injury or death ("High Risk Product"). By
* including Cypress's product in a High Risk Product, the manufacturer of such
* system or application assumes all risk of such use and in doing so agrees to
* indemnify Cypress against all liability.
*******************************************************************************/

/******************************************************************************
 * Include header files
 ******************************************************************************/
#include "cyhal.h"
#include "cybsp.h"
#include "cycfg_capsense.h"
#include "cycfg_ble.h"
#include "cy_retarget_io.h"
#include "tuner_ble_server.h"


/*******************************************************************************
* Macros
*******************************************************************************/
#define ENABLE                       (1u)
#define DISABLE                      (0u)
#define CY_ASSERT_FAILED             (0u)
#define DEBUG_BLE_ENABLE             (DISABLE)
#if DEBUG_BLE_ENABLE
#define DEBUG_PRINTF                 (printf)
#else
#define DEBUG_PRINTF(...)
#endif

/* BLE related macros */
#define BLESS_INTR_PRIORITY          (1u)
#define NOTIFICATION_PKT_SIZE        (492u)
#define SUCCESS                      (0U)
#define DEVICE_NAME_LENGTH           (20u)
#define DEFAULT_NOTIFICATION_COUNT   (1u)

/* Length of notification packet to send size of CapSense structure(2 bytes)
 * No of notification packets required to send complete CapSense data(1 byte) */
#define TUNER_BRIDGE_INIT_NTF_SIZE   (3u)
#define CAPSENSE_DS_SIZE_LSB_IDX     (0u)
#define CAPSENSE_DS_SIZE_MSB_IDX     (1u)
#define NOTIFICATION_COUNT_IDX       (2u)

/* Custom Tuner command packet received from GATT Client - 7 bytes */
#define TUNER_COMMAND_SIZE_0_IDX     (0u)
#define TUNER_COMMAND_OFFS_0_IDX     (1u)
#define TUNER_COMMAND_OFFS_1_IDX     (2u)
#define TUNER_COMMAND_DATA_0_IDX     (3u)
#define TUNER_COMMAND_DATA_1_IDX     (4u)
#define TUNER_COMMAND_DATA_2_IDX     (5u)
#define TUNER_COMMAND_DATA_3_IDX     (6u)
#define TUNER_COMMAND_PACKET_SIZE    (7u)
#define MAX_DATA_LENGTH              (4u)
#define MSB_SHIFT                    (8u)


/*******************************************************************************
 * Global variables
 ******************************************************************************/
/* No of notification packets to send one complete CapSense structure */
static uint8_t count = DEFAULT_NOTIFICATION_COUNT;

/* Buffer to hold Tuner receive command packet */
static uint8_t ble_write_buffer[TUNER_COMMAND_PACKET_SIZE] = {0};

/* Size of the CapSense data structure */
static uint16_t capsense_ds_size = 0;

/* To indicate that notification is enabled by GATT client */
static volatile bool ble_notification_enabled = false;

/* To store the connection handle */
static cy_stc_ble_conn_handle_t appConnHandle;

/* To send notification packet to GATT client */
static cy_stc_ble_gatts_handle_value_ntf_t notificationPacket;

static volatile bool ble_disconnected = false;


/*******************************************************************************
 * Function Prototypes
*******************************************************************************/
static void bless_interrupt_handler(void);
static void stack_event_handler(uint32_t event, void* eventParam);


/*******************************************************************************
* Function Name: bless_interrupt_handler
********************************************************************************
* Summary:
* Wrapper function for handling interrupts from BLESS.
*
*******************************************************************************/
static void bless_interrupt_handler(void)
{
    Cy_BLE_BlessIsrHandler();
}


/*******************************************************************************
 * Function Name: ble_capsense_tuner_init()
 *******************************************************************************
 *
 * Summary:
 *   This function initializes the BLE for use in the code example.
 *
 ******************************************************************************/
void ble_capsense_tuner_init(void)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_SUCCESS;

