Infineon/mtb-example-psoc6-ble-capsense-tuner-server/tuner_ble_server.c
    /* BLESS interrupt configuration structure */
    const cy_stc_sysint_t  blessIsrCfg =
    {
            /* The BLESS interrupt */
            .intrSrc       = bless_interrupt_IRQn,

            /* The interrupt priority number */
            .intrPriority  = BLESS_INTR_PRIORITY
    };

    /* Initialize the BLESS interrupt */
    cy_ble_config.hw->blessIsrConfig = &blessIsrCfg;

    /* Hook interrupt service routines for BLESS */
    Cy_SysInt_Init(cy_ble_config.hw->blessIsrConfig, bless_interrupt_handler);

    /* Register the generic event handler */
    Cy_BLE_RegisterEventCallback(stack_event_handler);

    /* Initialize the BLE host */
    apiResult = Cy_BLE_Init(&cy_ble_config);

    if (apiResult != CY_BLE_SUCCESS)
    {
        /* BLE stack initialization failed, check configuration, notify error
         * and halt CPU in debug mode */
        DEBUG_PRINTF("Cy_BLE_Init API Error: %x \r\n", apiResult);
    }
    else
    {
        DEBUG_PRINTF("Cy_BLE_Init API Success: %x \r\n", apiResult);
    }

    /* Enable BLE */
    apiResult = Cy_BLE_Enable();

    if (apiResult != CY_BLE_SUCCESS)
    {
        /* BLE stack initialization failed, check configuration,
             notify error and halt CPU in debug mode */
        DEBUG_PRINTF("Cy_BLE_Enable API Error: %x \r\n", apiResult);
        CY_ASSERT(CY_ASSERT_FAILED);
    }
}

/*******************************************************************************
* Function Name: stack_event_handler
********************************************************************************
*
* Summary:
*   This is an event callback function to receive events from the BLE Component.
*
* Parameters:
*  uint32_t event     : Event from the BLE stack
*  void* eventParam : Pointer to the value of event specific parameters
*
*******************************************************************************/
static void stack_event_handler(uint32_t event, void* eventParam)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_SUCCESS;

    switch(event)
    {
    /***************************************************************************
     *                       General Events
     **************************************************************************/

    /* This event is received when the BLE component is Started */
    case CY_BLE_EVT_STACK_ON:
    {
        DEBUG_PRINTF("BLE Stack Event: CY_BLE_EVT_STACK_ON \r\n");

        /* Enter into discoverable mode so that remote device can search it */
        apiResult = Cy_BLE_GAPP_StartAdvertisement(CY_BLE_ADVERTISING_FAST,\
                CY_BLE_PERIPHERAL_CONFIGURATION_0_INDEX);
        if(apiResult != CY_BLE_SUCCESS)
        {
            DEBUG_PRINTF("Cy_BLE_GAPP_StartAdvertisement API Error: %d \r\n",\
                          apiResult);
        }
        break;
    }

    /* This event is received when there is a timeout */
    case CY_BLE_EVT_TIMEOUT:
    {
        DEBUG_PRINTF("BLE Stack Event - Event timeout");
        break;
    }

    /***************************************************************************
     *                       GAP Events
     **************************************************************************/

    /* This event indicates peripheral device has started/stopped advertising */
    case CY_BLE_EVT_GAPP_ADVERTISEMENT_START_STOP:
    {
        char device_name[DEVICE_NAME_LENGTH];
        DEBUG_PRINTF("BLE Stack Event :"\
                     "CY_BLE_EVT_GAPP_ADVERTISEMENT_START_STOP:\n\r");
        cy_en_ble_adv_state_t adv_state = CY_BLE_ADV_STATE_STOPPED;

        adv_state = Cy_BLE_GetAdvertisementState();
        if(adv_state == CY_BLE_ADV_STATE_ADVERTISING)
        {
            printf("\n\rDevice is advertising with name: ");
            Cy_BLE_GetLocalName(device_name);
            printf("%s\n\r",device_name);
        }
        else if((adv_state == CY_BLE_ADV_STATE_STOPPED) &&\
                (Cy_BLE_GetConnectionState(appConnHandle) ==\
                 CY_BLE_CONN_STATE_DISCONNECTED))
        {
            printf("Restarting Advertisement \r\n");
            printf("\n\rDevice is advertising with name: ");
            Cy_BLE_GetLocalName(device_name);
            printf("%s\n\r",device_name);

            /* Enter into discoverable mode so that remote device can search it */
            Cy_BLE_GAPP_StartAdvertisement(CY_BLE_ADVERTISING_FAST,\
                    CY_BLE_PERIPHERAL_CONFIGURATION_0_INDEX);

        }
        break;
    }

    case CY_BLE_EVT_GAP_DEVICE_CONNECTED:
    {
        /* BLE link is established */
        DEBUG_PRINTF("BLE Stack Event : CY_BLE_EVT_GAP_DEVICE_CONNECTED \r\n");
        cy_stc_ble_gap_enhance_conn_complete_param_t *conn_param =\
                (cy_stc_ble_gap_enhance_conn_complete_param_t *)eventParam;

        printf("\n\rConnected to device: ");
        for(uint8_t i = (CY_BLE_BD_ADDR_SIZE); i > 0u; i--)
        {
            printf(" %X", conn_param->peerBdAddr[i - 1u]);
        }

        DEBUG_PRINTF("\r\nBDhandle : 0x%02X\r\n", conn_param->bdHandle);

        /* Reset notification enabled flag */
        ble_notification_enabled = false;

        /* Reset ble_disconnected enabled flag */
        ble_disconnected = false;

        /* Turn ON the user LED when ble connection is established */
        cyhal_gpio_write((cyhal_gpio_t)CYBSP_USER_LED1, CYBSP_LED_STATE_ON);
        break;
    }

    /* This event is triggered when there is a change to either the maximum
     * Payload length or the maximum transmission time of Data Channel PDUs in
     * either direction */
    case CY_BLE_EVT_DATA_LENGTH_CHANGE:
    {
        DEBUG_PRINTF("CY_BLE_EVT_DATA_LENGTH_CHANGE \r\n");
        cy_stc_ble_set_phy_info_t phyParam;

        /* Configure the BLE stack for 2Mbps data rate */
        phyParam.bdHandle = appConnHandle.bdHandle;
        phyParam.allPhyMask = CY_BLE_PHY_NO_PREF_MASK_NONE;
        phyParam.phyOption = 0;
        phyParam.rxPhyMask = CY_BLE_PHY_MASK_LE_2M;
        phyParam.txPhyMask = CY_BLE_PHY_MASK_LE_2M;

