Infineon/mtb-example-psoc6-ble-capsense-tuner-server/tuner_ble_server.c
        apiResult = Cy_BLE_SetPhy(&phyParam);
        if(apiResult != CY_BLE_SUCCESS)
        {
            DEBUG_PRINTF("Failed to set PHY..[bdHandle 0x%02X] : 0x%4x\r\n",\
                    phyParam.bdHandle, apiResult);
        }
        else
        {
            DEBUG_PRINTF("Setting PHY.[bdHandle 0x%02X] \r\n",\
                                                           phyParam.bdHandle);
        }
        break;
    }

    /* This event is generated when disconnected from remote device or failed to
     * establish connection. */
    case CY_BLE_EVT_GAP_DEVICE_DISCONNECTED:
    {
        if(Cy_BLE_GetConnectionState(appConnHandle) ==\
                                            CY_BLE_CONN_STATE_DISCONNECTED)
        {
            DEBUG_PRINTF("CY_BLE_EVT_GAP_DEVICE_DISCONNECTED %d\r\n",\
                    CY_BLE_CONN_STATE_DISCONNECTED);
            printf("Disconnected. \r\n\n");
        }

        /* Set ble_disconnected flag to true */
        ble_disconnected = true;

        /*Reset ble_notification_enabled flag to false */
        ble_notification_enabled = false;

        /* BLE disconnected - turn off LED */
        cyhal_gpio_write((cyhal_gpio_t)CYBSP_USER_LED1,CYBSP_LED_STATE_OFF);

        /* Device disconnected; restart advertisement */
        Cy_BLE_GAPP_StartAdvertisement(CY_BLE_ADVERTISING_FAST,\
                                       CY_BLE_PERIPHERAL_CONFIGURATION_0_INDEX);
        break;
    }

    /* This event is generated at the GAP Central and the peripheral end after
     * connection parameter update is requested from the host to the controller
     */
    case CY_BLE_EVT_GAP_CONNECTION_UPDATE_COMPLETE:
    {
        DEBUG_PRINTF("CY_BLE_EVT_GAP_CONNECTION_UPDATE_COMPLETE \r\n");
        break;
    }

    case CY_BLE_EVT_SET_PHY_COMPLETE:
    {
        DEBUG_PRINTF("Updating the Phy.....\r\n");
        cy_stc_ble_events_param_generic_t * param =\
                (cy_stc_ble_events_param_generic_t *) eventParam;
        if(param->status == SUCCESS)
        {
            DEBUG_PRINTF("SET PHY updated to 2 Mbps\r\n");
        }
        else
        {
            DEBUG_PRINTF("SET PHY Could not update to 2 Mbps\r\n");
        }
        break;
    }

    /* This event indicates that the controller has changed the transmitter
     * PHY or receiver PHY in use */
    case CY_BLE_EVT_PHY_UPDATE_COMPLETE:
    {
        DEBUG_PRINTF("UPDATE PHY parameters\r\n");
        /* To remove unused parameter warning when UART debug is disabled */
#if (DEBUG_BLE_ENABLE == ENABLE)
        cy_stc_ble_events_param_generic_t *param =\
                (cy_stc_ble_events_param_generic_t *)eventParam;
        cy_stc_ble_phy_param_t *phyparam = NULL;
        if(param->status == SUCCESS)
        {
            phyparam = (cy_stc_ble_phy_param_t *)param->eventParams;
            DEBUG_PRINTF("RxPhy Mask : 0x%02X\r\nTxPhy Mask : 0x%02X\r\n",\
                    phyparam->rxPhyMask, phyparam->txPhyMask);
        }
#endif
        break;
    }

    /***************************************************************************
     *                       GATT Events
     **************************************************************************/

    /* This event is generated at the GAP Peripheral end after connection is
     * completed with peer Central device. */
    case CY_BLE_EVT_GATT_CONNECT_IND:
    {
        appConnHandle = *(cy_stc_ble_conn_handle_t *)eventParam;
        DEBUG_PRINTF("CY_BLE_EVT_GATT_CONNECT_IND: %x, %x \r\n",\
                      appConnHandle.attId,\
                      appConnHandle.bdHandle);
        Cy_BLE_GetPhy(appConnHandle.bdHandle);
        break;
    }

    /* This event is generated at the GAP Peripheral end after disconnection. */
    case CY_BLE_EVT_GATT_DISCONNECT_IND:
    {
        DEBUG_PRINTF("CY_BLE_EVT_GATT_DISCONNECT_IND \r\n");

        if(appConnHandle.bdHandle ==\
                (*(cy_stc_ble_conn_handle_t *)eventParam).bdHandle)
        {
            appConnHandle.bdHandle = CY_BLE_INVALID_CONN_HANDLE_VALUE;
            appConnHandle.attId    = CY_BLE_INVALID_CONN_HANDLE_VALUE;
        }

        break;
    }

    /* This event is triggered when GATT MTU Exchange Request received from
     * GATT client device. */
    case CY_BLE_EVT_GATTS_XCNHG_MTU_REQ:
    {
        /* To remove unused parameter warning when UART debug is disabled */
#if (DEBUG_BLE_ENABLE == ENABLE)
        uint16_t negotiated_mtu = 0;
        negotiated_mtu =\
        (((cy_stc_ble_gatt_xchg_mtu_param_t *)eventParam)->mtu < CY_BLE_GATT_MTU) ?\
        ((cy_stc_ble_gatt_xchg_mtu_param_t *)eventParam)->mtu : CY_BLE_GATT_MTU;
        DEBUG_PRINTF("CY_BLE_EVT_GATTS_XCNHG_MTU_REQ negotiated = %d\r\n",\
                      negotiated_mtu);
#endif
        break;
    }

    /* This event is triggered when a  write request is received from a peer
     * Client device */
    case CY_BLE_EVT_GATTS_WRITE_REQ:
    {
        uint16_t size = 0;
        uint8_t tuner_init_buffer[TUNER_BRIDGE_INIT_NTF_SIZE] = {0};

        cy_stc_ble_gatt_write_param_t *write_req_param =\
                (cy_stc_ble_gatt_write_param_t *)eventParam;
        cy_stc_ble_gatts_db_attr_val_info_t attr_param;

        attr_param.connHandle.bdHandle = write_req_param->connHandle.bdHandle;
        attr_param.connHandle.attId = write_req_param->connHandle.attId;
        attr_param.flags = CY_BLE_GATT_DB_PEER_INITIATED;
        attr_param.handleValuePair = write_req_param->handleValPair;
        attr_param.offset = 0;

        if(write_req_param->handleValPair.attrHandle ==\
           CY_BLE_CAPSENSE_TUNER_CAPSENSE_DS_CLIENT_CHARACTERISTIC_CONFIGURATION_DESC_HANDLE)
        {
            /* Write Response to GATT Client in response to Write request */
            Cy_BLE_GATTS_WriteRsp(write_req_param->connHandle);

            ble_notification_enabled = attr_param.handleValuePair.value.val[0];
            notificationPacket.connHandle = appConnHandle;
            notificationPacket.handleValPair.attrHandle =\
                    CY_BLE_CAPSENSE_TUNER_CAPSENSE_DS_CHAR_HANDLE;

            /* If notification is enabled, send size of CapSense data structure
             * and the number of notification packets required to send the
             * CapSense data structure to the GATT client to initialize the
             * Tuner bridge */
            if(ble_notification_enabled == true)
            {
                printf("\n\rNotifications enabled... \n\r");
                printf("\n\rSending Tuner bridge initialization parameters"\
                           "to GATT Client... \n\r");
                capsense_ds_size = sizeof(cy_capsense_tuner);
                size = capsense_ds_size;

                /* Calculate how many notification packets are required to
                 * transmit the CapSense data structure */
                while(1)
                {
                    if(size > NOTIFICATION_PKT_SIZE)
                    {
                        size = size - NOTIFICATION_PKT_SIZE;
                        count++;
                    }
                    else
                    {
                        break;
                    }
                }
                tuner_init_buffer[CAPSENSE_DS_SIZE_LSB_IDX] =\
                                           (uint8_t)(capsense_ds_size & 0x00FF);
                tuner_init_buffer[CAPSENSE_DS_SIZE_MSB_IDX] =\
                                           (uint8_t)(capsense_ds_size >> 8);
                tuner_init_buffer[NOTIFICATION_COUNT_IDX] = count;

                printf("Size of CapSense Data Structure: %u\n\r",\
                                                capsense_ds_size);
                printf("Notification packet size: %u \n\r",\
                                                NOTIFICATION_PKT_SIZE);
                printf("No of notifications to send complete data structure: "\
                                                "%u\n\r", count);
                /* Send Bridge initialization parameters */
                notificationPacket.handleValPair.value.len =\
                                                 TUNER_BRIDGE_INIT_NTF_SIZE;
                notificationPacket.handleValPair.value.val = tuner_init_buffer;
                /* Send notification to GATT client to initialize tuner bridge
                 * parameters */
                Cy_BLE_GATTS_Notification(&notificationPacket);
            }
        }
        break;
    }

    /* This event is generated when a write without response is generated from
     * GATT Client */
    case CY_BLE_EVT_GATTS_WRITE_CMD_REQ:
    {
        uint16_t offset_address= 0;
        uint8_t length = 0;

        cy_stc_ble_gatts_write_cmd_req_param_t write_cmd_param =\
                *(cy_stc_ble_gatts_write_cmd_req_param_t *) eventParam;

        /* Check if length of received packet is equal to
         * TUNER_COMMAND_PACKET_SIZE */
        if(write_cmd_param.handleValPair.value.len == TUNER_COMMAND_PACKET_SIZE)
        {
            memcpy(ble_write_buffer,\
                   write_cmd_param.handleValPair.value.val,\
                   write_cmd_param.handleValPair.value.len);

            offset_address =\
            ((uint16_t)ble_write_buffer[TUNER_COMMAND_OFFS_0_IDX] << MSB_SHIFT)\
             | (uint16_t)ble_write_buffer[TUNER_COMMAND_OFFS_1_IDX];

            length = ble_write_buffer[TUNER_COMMAND_SIZE_0_IDX];

            if(length <= MAX_DATA_LENGTH)
            {
                /* Modify CapSense data structure */
                for (uint8_t i = 0 , j = MAX_DATA_LENGTH - 1; i < length; i++, j--)
                {
                    *(((uint8_t *)&cy_capsense_tuner) + offset_address + i) =\
                        ble_write_buffer[TUNER_COMMAND_DATA_0_IDX + j];
                }
            }
        }
        break;
    }

    /***************************************************************************
     *                       Other Events
     **************************************************************************/
    default:
        break;
    }
}


