Infineon/mtb-example-psoc6-ble-capsense-tuner-server/tuner_ble_server.c
/*******************************************************************************
* Function Name: ble_capsense_process
********************************************************************************
*
* Summary:
*   -  allows the BLE stack to process pending events
*
*******************************************************************************/
void ble_process_events(void)
{
    /* Cy_BLE_ProcessEvents() allows the BLE stack to process pending events */
    Cy_BLE_ProcessEvents();
}


/*******************************************************************************
* Function Name: tuner_send_callback
********************************************************************************
*
* Summary:
*   - Tuner send callback function periodically called by CapSense_RunTuner().
*   - This function sends CapSense data structure to the GATT client as
*     notification packets to be read by the Tuner GUI
*
* Parameters:
*  void * context: The pointer to the CapSense context structure
*
*******************************************************************************/
void tuner_send_callback(void * context)
{
    /* To remove compiler warning  */
    (void)context;
    cy_en_ble_api_result_t api_result = CY_BLE_SUCCESS;
    uint8_t *ptr_capsense = NULL;
    uint8_t notification_count = 0;

    /* Remaining bytes that is less than NOTIFICATION_PKT_SIZE */
    uint16_t remaining_bytes = 0;

    /* Variable to keep track of CapSense structure current index */
    uint8_t index = 0;

    ptr_capsense = (uint8_t *)&cy_capsense_tuner;
    notification_count = count;
    remaining_bytes = capsense_ds_size % NOTIFICATION_PKT_SIZE;

    /* Cy_Ble_ProcessEvents() allows BLE stack to process pending events */
    Cy_BLE_ProcessEvents();

    if(ble_notification_enabled == true)
    {
        while(notification_count > 0u)
        {
            /* Allows BLE stack to process pending events */
            Cy_BLE_ProcessEvents();

            if(ble_disconnected == true)
            {
                /* BLE disconnect event occurred. Exit from while loop */
                break;
            }

            /* Check if BLE stack is free */
            if(Cy_BLE_GATT_GetBusyStatus(appConnHandle.attId) == CY_BLE_STACK_STATE_FREE)
            {
                if(notification_count > 1)
                {
                    notificationPacket.handleValPair.value.len = NOTIFICATION_PKT_SIZE;
                }
                else
                {
                    notificationPacket.handleValPair.value.len = remaining_bytes;
                }

                /* Update the notification packet with CapSense Tuner structure */
                notificationPacket.handleValPair.value.val =\
                        (ptr_capsense + (index * NOTIFICATION_PKT_SIZE));

                /* Send notification to GATT Client */
                api_result = Cy_BLE_GATTS_Notification(&notificationPacket);

                if(api_result == CY_BLE_SUCCESS)
                {
                    notification_count--;
                    index++;
                }
            }
        }
    }
}


/* [] END OF FILE */